 <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [1]:
import pandas as pd
import numpy as np

# 데이터 정제

## 누락값 처리

* 대부분의 실제 데이터들은 정제되지 않고 누락값들이 존재
* 서로 다른 데이터들은 다른 형태의 결측을 가짐
* 결측 데이터는 `null`, `NaN`, `NA`로 표기

### None: 파이썬 누락 데이터

In [2]:
a = np.array([1, 2, None, 4, 5])
a

array([1, 2, None, 4, 5], dtype=object)

In [3]:
# a.sum()

### NaN: 누락된 수치 데이터

In [4]:
a = np.array([1, 2, np.nan, 4, 5])
a.dtype

dtype('float64')

In [5]:
0 + np.nan

nan

In [6]:
np.nan + np.nan

nan

In [7]:
a.sum(), a.min(), a.max()

(nan, nan, nan)

In [8]:
np.nansum(a), np.nanmin(a), np.nanmax(a)

(12.0, 1.0, 5.0)

In [9]:
pd.Series([1, 2, np.nan, 4, None])

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [10]:
s = pd.Series(range(5), dtype=int)
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [11]:
s[0] = None
s

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [12]:
s[3] = np.nan
s

0    NaN
1    1.0
2    2.0
3    NaN
4    4.0
dtype: float64

In [13]:
s = pd.Series([True, False, None, np.nan])
s

0     True
1    False
2     None
3      NaN
dtype: object

### Null 또는 NaN 확인하기

In [14]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [16]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [17]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

### Null 값 처리

|인자|설명|
|:---:|:---|
|`isnull()`|누락되거나 NA인 값을 boolean값으로 변환|
|`notnull()`|`isnull( )`의 반대|
|`dropna()`|누락된 데이터가 있는 축 제외|
|`fillna()`|누락된 값을 대체하거나 ```ffill```이나 `bfill`로 보간 메소드 적용|
|`interpolate()`||

In [18]:
s = pd.Series([1, 2, np.nan, 'String', None])

In [19]:
s.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [20]:
s[s.notnull()]

0         1
1         2
3    String
dtype: object

In [21]:
s.dropna()

0         1
1         2
3    String
dtype: object

In [22]:
df = pd.DataFrame(np.random.randn(10,3), index=range(10), columns=['A', 'B','C'])

In [23]:
df.dropna(axis='columns')

          A         B         C
0 -1.389919  0.071663 -0.379823
1 -1.734029  0.654320 -1.127746
2  0.349235  1.140657 -1.265880
3 -0.186987  1.937715 -0.082995
4  1.343483  0.044385  1.591165
5  0.486642  0.734868  1.648183
6  1.307645  1.955777 -0.068356
7 -0.361889  0.597268 -0.786736
8 -1.190470 -0.713836 -0.039690
9  1.472891 -0.182099 -2.415209

In [24]:
df[3] = np.nan
df

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [25]:
df.dropna(axis='columns', how='all')

          A         B         C
0 -1.389919  0.071663 -0.379823
1 -1.734029  0.654320 -1.127746
2  0.349235  1.140657 -1.265880
3 -0.186987  1.937715 -0.082995
4  1.343483  0.044385  1.591165
5  0.486642  0.734868  1.648183
6  1.307645  1.955777 -0.068356
7 -0.361889  0.597268 -0.786736
8 -1.190470 -0.713836 -0.039690
9  1.472891 -0.182099 -2.415209

thresh = n : n 개 이상의 null 값 존재시 drop

In [26]:
df.dropna(axis='rows', thresh=3)

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [27]:
s

0         1
1         2
2       NaN
3    String
4      None
dtype: object

In [28]:
s.fillna(0)

0         1
1         2
2         0
3    String
4         0
dtype: object

In [29]:
s.fillna(method='ffill')

0         1
1         2
2         2
3    String
4    String
dtype: object

In [30]:
s.fillna(method='bfill')

0         1
1         2
2    String
3    String
4      None
dtype: object

In [31]:
df

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [32]:
df.fillna(method='ffill', axis=0)

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [33]:
df.fillna(method='ffill', axis=1)

          A         B         C         3
0 -1.389919  0.071663 -0.379823 -0.379823
1 -1.734029  0.654320 -1.127746 -1.127746
2  0.349235  1.140657 -1.265880 -1.265880
3 -0.186987  1.937715 -0.082995 -0.082995
4  1.343483  0.044385  1.591165  1.591165
5  0.486642  0.734868  1.648183  1.648183
6  1.307645  1.955777 -0.068356 -0.068356
7 -0.361889  0.597268 -0.786736 -0.786736
8 -1.190470 -0.713836 -0.039690 -0.039690
9  1.472891 -0.182099 -2.415209 -2.415209

In [34]:
df.fillna(method='bfill', axis=0)

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [35]:
df.fillna(method='bfill', axis=1)

          A         B         C   3
0 -1.389919  0.071663 -0.379823 NaN
1 -1.734029  0.654320 -1.127746 NaN
2  0.349235  1.140657 -1.265880 NaN
3 -0.186987  1.937715 -0.082995 NaN
4  1.343483  0.044385  1.591165 NaN
5  0.486642  0.734868  1.648183 NaN
6  1.307645  1.955777 -0.068356 NaN
7 -0.361889  0.597268 -0.786736 NaN
8 -1.190470 -0.713836 -0.039690 NaN
9  1.472891 -0.182099 -2.415209 NaN

In [36]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [37]:
# fill missing age with median age for each group (teacher, student)
df["age"].fillna(df.groupby("job")["age"].transform("median"), inplace=True)

#### `df.interpolate()`

In [40]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
df

               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5

In [41]:
df.interpolate()

               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

## 중복 제거

In [165]:
df = pd.DataFrame({'c1': ['a', 'b', 'c'] * 2 + ['b'] + ['c'],
                   'c2': [1, 2, 1, 1, 2, 3, 3, 4]})
df

  c1  c2
0  a   1
1  b   2
2  c   1
3  a   1
4  b   2
5  c   3
6  b   3
7  c   4

In [166]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [167]:
df.drop_duplicates()

  c1  c2
0  a   1
1  b   2
2  c   1
5  c   3
6  b   3
7  c   4

In [168]:
df.drop_duplicates('c1', keep='last')

  c1  c2
3  a   1
6  b   3
7  c   4

## Unique

In [169]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [170]:
print( df.job.unique() )

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

In [171]:
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
basketball player    1
developer            1
dentist              1
Name: job, dtype: int64

### is_unique()

In [172]:
df.set_index('name', inplace=True)
df

                       job
name
John               teacher
Nate               teacher
Fred               teacher
Abraham            student
Brian              student
Janny            developer
Nate               teacher
Obrian             dentist
Yuna               teacher
Rob                 lawyer
Brian              student
Matt               student
Wendy               banker
Edward             teacher
Ian                teacher
Chris               banker
Philip              lawyer
Janny    basketball player
Gwen               teacher
Jessy              student

In [173]:
df.index.is_unique

False

## 값 치환

In [174]:
s = pd.Series([1., 2., -999., 3., -1000., 4.])
s

0       1.0
1       2.0
2    -999.0
3       3.0
4   -1000.0
5       4.0
dtype: float64

In [175]:
s.replace(-999, np.nan)

0       1.0
1       2.0
2       NaN
3       3.0
4   -1000.0
5       4.0
dtype: float64

In [176]:
s.replace([-999, -1000], np.nan)

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
5    4.0
dtype: float64

In [177]:
s.replace([-999, -1000], [np.nan, 0])

0    1.0
1    2.0
2    NaN
3    3.0
4    0.0
5    4.0
dtype: float64

###### 출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas